In [3]:
import pandas as pd
import numpy as np

In [6]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [10]:
pd.Series( my_data, labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1 = pd.Series([1,2,3,4],['usa','germany','ussr','japan'])

In [20]:
ser1

usa        1
germany    2
ussr       3
japan      4
dtype: int64

In [23]:
ser1['usa']

1

In [24]:
ser2 = pd.Series([5,6,7,8],['usa','germany','italy','japan'])

In [25]:
ser1 + ser2

germany     8.0
italy       NaN
japan      12.0
usa         6.0
ussr        NaN
dtype: float64

__DataFrames__

In [27]:
import numpy as np
import pandas as pd

In [28]:
from numpy.random import randn

In [29]:
np.random.seed(101)

In [63]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z',])

In [64]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [65]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [66]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [67]:
df['new'] = df['Y'] + df['X']

In [39]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [68]:
df.drop('new', axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [69]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
B -0.134841  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476
E -0.116773  1.901755  0.238127  1.996652  2.139882

In [70]:
df.shape

(5, 5)

In [71]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
B -0.134841  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476
E -0.116773  1.901755  0.238127  1.996652  2.139882

In [72]:
df.loc['A','Y']

-1.7060859307350775

In [73]:
df.iloc[0]

W      0.302665
X      1.693723
Y     -1.706086
Z     -1.159119
new   -0.012363
Name: A, dtype: float64

In [75]:
booldf = df> 0

In [76]:
df[booldf]

          W         X         Y         Z       new
A  0.302665  1.693723       NaN       NaN       NaN
B       NaN  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  2.139882

In [77]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [78]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [79]:
df[df['W']>0]

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
C  0.807706  0.072960  0.638787  0.329646  0.711747

In [82]:
df[(df['Z']>0)]

          W         X         Y         Z       new
B -0.134841  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476
E -0.116773  1.901755  0.238127  1.996652  2.139882

In [83]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
B -0.134841  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476
E -0.116773  1.901755  0.238127  1.996652  2.139882

In [84]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
1     B -0.134841  0.390528  0.166905  0.184502  0.557432
2     C  0.807706  0.072960  0.638787  0.329646  0.711747
3     D -0.497104 -0.754070 -0.943406  0.484752 -1.697476
4     E -0.116773  1.901755  0.238127  1.996652  2.139882

In [92]:
newind = 'CA NY WY OR CO'.split()

In [93]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [94]:
df['States'] = newind

In [95]:
df

          W         X         Y         Z       new States
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363     CA
B -0.134841  0.390528  0.166905  0.184502  0.557432     NY
C  0.807706  0.072960  0.638787  0.329646  0.711747     WY
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476     OR
E -0.116773  1.901755  0.238127  1.996652  2.139882     CO

In [97]:
df.set_index('States')

               W         X         Y         Z       new
States
CA      0.302665  1.693723 -1.706086 -1.159119 -0.012363
NY     -0.134841  0.390528  0.166905  0.184502  0.557432
WY      0.807706  0.072960  0.638787  0.329646  0.711747
OR     -0.497104 -0.754070 -0.943406  0.484752 -1.697476
CO     -0.116773  1.901755  0.238127  1.996652  2.139882

In [98]:
import numpy as np
import pandas as pd

In [101]:
outside =['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [102]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [103]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [106]:
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [107]:
df.index.names = ['Groups', 'num']

In [108]:
df

                   A         B
Groups num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [112]:
df.loc['G2'].loc[2]['B']

-0.6102588558227414

In [113]:
df.xs

<bound method NDFrame.xs of                    A         B
Groups num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419>

In [115]:
df.xs(1, level='num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

__Missing Data__

In [116]:
d = {'A': [1,2, np.nan],'B': [5,np.nan,np.nan],'C': [1,2, 3]}

In [117]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [118]:
df = pd.DataFrame(d)

In [119]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [120]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [121]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [125]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [126]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [127]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [128]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

__Group By__

In [130]:
data = {'company': ['GOOG','GOOG', 'MSFT','MSFT','FB','FB'],
       'Person': ['Sam', 'Charlie', 'Amy','Ven','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [131]:
df = pd.DataFrame(data)

In [132]:
df

  company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT      Ven    124
4      FB     Carl    243
5      FB    Sarah    350

In [134]:
grp = df.groupby('company')

In [136]:
grp.mean()

         Sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

__concatinating__

In [137]:
pd.concat([df1,df2,df3], axis=1)

NameError: name 'df1' is not defined

__merging__

In [138]:
pd.merge(left,right,how='inner', on='key')

NameError: name 'left' is not defined

__joining__

In [139]:
left.join(right)

NameError: name 'left' is not defined

# __operation__

In [141]:
df = pd.DataFrame({
                    'col1': [1,2,3,4],
                    'col2': [444,555,666,777],
                    'col3': ['abc','def','ghi','xyz']
})

In [142]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [145]:
df['col2'].nunique()

4

In [147]:
df['col2'].value_counts()

444    1
555    1
666    1
777    1
Name: col2, dtype: int64

In [148]:
df['col2'] > 2

0    True
1    True
2    True
3    True
Name: col2, dtype: bool

In [149]:
df['col1'].sum()

10

In [156]:
def times2(x):
    return x*2

In [158]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3    1554
Name: col2, dtype: int64

In [159]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [160]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [161]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [162]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [164]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [165]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [166]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [167]:
df.sort_values

<bound method DataFrame.sort_values of    col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz>

In [169]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [170]:
data =  { 'A':['foo','foo','foo','bar','bar','bar',],
         'B': ['one','one','two','two','one','one'],
         'C': ['x','y','x','y','x','y'],
         'D': [1,2,3,5,4,5]
    
}

In [171]:
df = pd.DataFrame(data)

In [172]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  5

In [176]:
df.pivot_table(values='D', index=['A','B'], columns=['C','B'])

C          x         y
B        one  two  one  two
A   B
bar one  4.0  NaN  5.0  NaN
    two  NaN  NaN  NaN  5.0
foo one  1.0  NaN  2.0  NaN
    two  NaN  3.0  NaN  NaN

__DATA I/P and O/P__

In [177]:
pwd

'C:\\Users\\DELL'

In [179]:
data = pd.read_html('https://api.vionweb.com/newsapi/news?fromTimestamp=2021-07-26')

HTTPError: HTTP Error 403: Forbidden